# Load gitignored machine local Brewfile
local = File.expand_path("~/.Brewfile_machine")
eval(File.read(local), binding, local) if File.exist?(local)

tap "coursier/formulas"
tap "felixkratz/formulae"
tap "nikitabobko/tap"
brew "act"
brew "bat"
brew "carapace"
brew "deno"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "imagemagick"
brew "luajit"
brew "luarocks"
brew "neovim"
brew "pandoc"
brew "pnpm"
brew "ripgrep"
brew "starship"
brew "stow"
brew "wget"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "nikitabobko/tap/aerospace"
cask "bruno"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-pro"
cask "ghostty"
cask "raycast"
cask "sf-symbols"
brew "cmake"
brew "pnpm"
cask "font-sketchybar-app-font"
